{
  "</audio>": 73463,
  "</box>": 73453,
  "</image>": 73449,
  "</image_id>": 73461,
  "</point>": 73457,
  "</quad>": 73455,
  "</ref>": 73451,
  "</slice>": 73459,
  "<audio>": 73462,
  "<box>": 73452,
  "<image>": 73448,
  "<image_id>": 73460,
  "<point>": 73456,
  "<quad>": 73454,
  "<ref>": 73450,
  "<slice>": 73458,
  "<|execute_end|>": 73444,
  "<|execute_start|>": 73443,
  "<|fim_middle|>": 73446,
  "<|fim_prefix|>": 73445,
  "<|fim_suffix|>": 73447,
  "<|im_end|>": 73440,
  "<|im_start|>": 73441,
  "<|tool_call|>": 73442
}
